//开关房门
/*
 旅馆里有一百个房间，从1到100编了号。第一个服务员把所有的房间门都打开了，
 第二个服务员把所有编号是2的倍数的房间“相反处理”，
 第三个服务员把所有编号是3的倍数的房间作“相反处理”，……，
 以后每个服务员都是如此。问第100个服务员来过后，哪几扇门是打开的。
 （所谓“相反处理”是：原来开着的门关上，原来关上的门打开。） 
 */
#include<stdio.h>
int a[100+10];
int main()
{
	int i,j,k;
	for(i=1;i<=100;i++)
		a[i]=0;
	for(i=1;i<=100;i++)
		for(j=1;j<=100;j++)
			if(j%i==0)
				a[j]=!(a[j]);
	for(k=1;k<=100;k++)
		if(a[k])
			printf("%d ",k);
	return 0;
} 

/////////////////////////////////////////// 

#include<iostream>
using namespace std;
int a[101] = {0};
int main(){
    int i, j;
    for(i = 1; i <= 100; ++i){
        for(j = 1; j <= 100; ++j){
            if(j % i == 0){
                if(a[j] == 0){
                    a[j] = 1;
                } else {
                    a[j] = 0;
                }               
            }
        }
    }
    for(i = 1; i <= 100; ++i){
        if(a[i] == 1){
            cout<<i<<" ";
        } 
    }
    return 0;
}
